<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;

class GetTopController extends Controller
{

    public function show(){
        $tableNames=array('14130001'=>'Аношко',
            '14130002'=>'Арцименя',
            '14130003'=>'Боровский',
            '14130004'=>'Варсоцкий',
            '14130005'=>'Викторов',
            '14130006'=>'Губарев',
            '14130007'=>'Дмитриев',
            '14130008'=>'Доменяко',
            '14130009'=>'Дука',
            '14130010'=>'Дятлов',
            '14130011'=>'Ивашин',
            '14130012'=>'Киевский',
            '14130014'=>'Корецкий',
            '14130016'=>'Кузнецов',
            '14130017'=>'Лагутин',
            '14130018'=>'Матюшев',
            '14130031'=>'Минь',
            '14130032'=>'Хоанг',
            '14130019'=>'Новаш',
            '14130020'=>'Окулов',
            '14130022'=>'Понедько',
            '14130023'=>'Рапин',
            '14130024'=>'Реут',
            '14130025'=>'Рогачева',
            '14130026'=>'admin',
            '14130027'=>'Уласевич',
            '14130028'=>'Федотов',
            '14130029'=>'Хальченя',
            '14130030'=>'Чурилов'
        );
        $funNames=array('14130001'=>'Окрошка Артем',
            '14130002'=>'Цыцыменя Даниил',
            '14130003'=>'Валентин Бебровский',
            '14130004'=>'Владислав Варварик',
            '14130005'=>'Максим Террорист-Викторов',
            '14130006'=>'Сашка Губарев',
            '14130007'=>'Дмитрий Андреев',
            '14130008'=>'Денис Писякака',
            '14130009'=>'Роман Дука',
            '14130010'=>'Даниил Борода',
            '14130011'=>'Вадим Ивашин',
            '14130012'=>'Артём Котлета',
            '14130014'=>'Даниил Корета',
            '14130016'=>'Роман Кузнецов',
            '14130017'=>'Валерий Лагутин',
            '14130018'=>'Алексей Матюшев(Исусу не холодно) ',
            '14130031'=>'Нгуен Минь Хиеп (вьетнамская мафия)',
            '14130032'=>'Нгуен Хоанг Хиеп (вьетнамская мафия)',
            '14130019'=>'Марковник',
            '14130020'=>'Илья Окопов',
            '14130022'=>'Дмитрий Понеделько',
            '14130023'=>'Анастасия Рапин',
            '14130024'=>'Тони Реут',
            '14130025'=>'Янка Рогачева',
            '14130026'=>'Стаснислав Бебра',
            '14130027'=>'Дарья Уласевич',
            '14130028'=>'Михаил Федотов на пересдачу',
            '14130029'=>'Даниил Хочется',
            '14130030'=>'Маша Чурилова');


        $json = file_get_contents('https://iis.bsuir.by/api/v1/rating?year=2021&sdef=20028');
        $obj = json_decode($json, true);
        //var_dump($obj[0]);
        $topOneRezi=$funNames[$obj[0]['studentCardNumber']];
        //echo"\n\nСЕЙЧАС ТОП 1 РЭЗИ ЭТО: ".$tableNames[$obj[0]['studentCardNumber']];





        return view('mainView', ['topOneRezi' => $topOneRezi,'topArray'=>$obj,'table'=>$tableNames, 'funNames'=>$funNames] );

    }
}
